app/controllers/posts_controller.rb

    def create
        #render plain: params[:post].inspect
        @post = Post.new(post_params)

        if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "mypost"], ["body", "my my post"], ["created_at", "2021-07-04 19:26:02.667921"], ["updated_at", "2021-07-04 19:26:02.667921"]]

    def update
        @post = Post.find(params[:id])
        if(@post.update(post_params))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "this is my post"], ["updated_at", "2021-07-05 15:01:13.197437"], ["id", 1]]